import React from 'react';
import './Home.css';
import { Carousel } from 'react-responsive-carousel';
import 'react-responsive-carousel/lib/styles/carousel.min.css';

function Home() {
  return (
    <div className="home-page">
      <img src="/banner.jpg" alt="Candy Shop Banner" className="banner" />
      <h1>Καλώς ήρθατε στον Καραμελόκοσμο!</h1>
      <p>Ανακαλύψτε τα αγαπημένα σας γλυκά και σοκολάτες!</p>
      <div className="intro-box">
        <p>
          Ο Καραμελόκοσμος δημιουργήθηκε τον Οκτώβριο 1994 απο τον Ανδρέα Ρηγόπουλο, παρουσιάζοντας το πρώτο εξειδικευμένο καραμελάδικο στη Νοτιοδυτική Ελλάδα. Λίγο αργότερα δημιουργήθηκε το Bon-Bon Bar του καραμελόκοσμου που περιοδεύει σε πολλές εκθέσεις κύρους ανά την Ελλάδα, φέροντας κάθε άνθρωπο ξεχωριστά στο γλυκό κόσμο των ζαχαροειδών και σοκολατοειδών προϊόντων. Με το πέρασμα του χρόνου ο Καραμελόκοσμος άνοιξε τα φτερά του στο χώρο της χονδρικής διάθεσης ζαχαρωδών και σοκολατεοιδών προϊόντων υψηλής ποιότητας, φτάνοντας να εξυπηρετεί σήμερα ένα μεγάλο αριθμό πελατών σε όλη τη χώρα.
          Ο Καραμελόκοσμος, έχοντας την ευχέρεια να αντιπροσωπεύει αυτή τη στιγμή ένα μεγάλο αριθμό οίκων του εξωτερικού, είναι έτοιμος να προσφέρει οποιοδήποτε είδος ζαχαροειδών προϊόντων και γλειφιτζουριών εξαιρετικής ποιότητος!
          Παράλληλα έχοντας ως σκοπό την παρουσίαση μιας ολοκληρωμένης πρότασης είναι σε θέση να προσφέρει μια τεράστια γκάμα κάθε τύπου ειδών υποστήριξης λιανικής πώλησης, από θήκες plexi-glass, μέχρι πλαστικές σακούλες, κορδέλες, χάρτινες σακούλες και κουτιά κάθε είδους.Επιπλέον παρέχει την εγγύηση ποιότητας για όλα τα είδη, προερχόμενη από τη δοκιμασία κάθε είδους πρώτα στο ίδιο του το κατάστημα και στο Bon-Bon Bar. Είναι σε θέση να ετοιμάσει και να αποστείλει τα εμπορεύματα σε οποιοδήποτε σημείο της χώρας μέσα σε ελάχιστο χρονικό διάστημα!
        </p>
      </div>
      <div className="carousel-wrapper">
        <Carousel showThumbs={false} infiniteLoop autoPlay>
          <div>
            <img src="https://picsum.photos/400/300" alt="Candy 1" />
          </div>
          <div>
            <img src="https://picsum.photos/400/300" alt="Candy 2" />
          </div>
          <div>
            <img src="https://picsum.photos/400/300" alt="Candy 3" />
          </div>
        </Carousel>
      </div>
    </div>
  );
}

export default Home;
